<?php

/*
request example

request[firstCategory]: 200000
request[secondCategory]: 0
request[classNo]:
request[itemTier]:
request[itemGrade]:
request[itemLevelMin]: 0
request[itemLevelMax]: 1600
request[itemName]:
request[gradeQuality]:
request[skillOptionList][0][firstOption]:
request[skillOptionList][0][secondOption]:
request[skillOptionList][0][minValue]:
request[skillOptionList][0][maxValue]:
request[skillOptionList][1][firstOption]:
request[skillOptionList][1][secondOption]:
request[skillOptionList][1][minValue]:
request[skillOptionList][1][maxValue]:
request[skillOptionList][2][firstOption]:
request[skillOptionList][2][secondOption]:
request[skillOptionList][2][minValue]:
request[skillOptionList][2][maxValue]:
request[etcOptionList][0][firstOption]:
request[etcOptionList][0][secondOption]:
request[etcOptionList][0][minValue]:
request[etcOptionList][0][maxValue]:
request[etcOptionList][1][firstOption]: 3
request[etcOptionList][1][secondOption]: 255
request[etcOptionList][1][minValue]: 5
request[etcOptionList][1][maxValue]:
request[etcOptionList][2][firstOption]:
request[etcOptionList][2][secondOption]:
request[etcOptionList][2][minValue]:
request[etcOptionList][2][maxValue]:
request[etcOptionList][3][firstOption]:
request[etcOptionList][3][secondOption]:
request[etcOptionList][3][minValue]:
request[etcOptionList][3][maxValue]:
request[pageNo]: 1
*/

return [
    'search' => [
        'cate' => [
            '0,0' => '전체 카테고리',
            '10000,0' => '장비 - 전체',
            '10000,180000' => '장비 - 무기',
            '10000,190010' => '장비 - 투구',
            '10000,190020' => '장비 - 상의',
            '10000,190030' => '장비 - 하의',
            '10000,190040' => '장비 - 장갑',
            '10000,190050' => '장비 - 어깨',
            '30000,0' => '어빌리티 스톤 - 전체',
            '200000,0' => '장신구 - 전체',
            '200000,200010' => '장신구 - 목걸이',
            '200000,200020' => '장신구 - 귀걸이',
            '200000,200030' => '장신구 - 반지',
            '200000,200040' => '장신구 - 팔찌',
            '210000,0' => '보석 - 전체',
        ],
        'class' => [
            '' => '전체 직업',
            '102' => '버서커',
            '103' => '디스트로이어',
            '104' => '워로드',
            '105' => '홀리나이트',
            '202' => '아르카나',
            '203' => '서머너',
            '204' => '바드',
            '205' => '소서리스',
            '302' => '배틀마스터',
            '303' => '인파이터',
            '304' => '기공사',
            '305' => '창술사',
            '312' => '스트라이커',
            '402' => '블레이드',
            '403' => '데모닉',
            '404' => '리퍼',
            '502' => '호크아이',
            '503' => '데빌헌터',
            '504' => '블래스터',
            '505' => '스카우터',
            '512' => '건슬링어',
        ],
        'grade' => [
            '0' => '일반',
            '1' => '고급',
            '2' => '희귀',
            '3' => '영웅',
            '4' => '전설',
            '5' => '유물',
        ],
        'tier' => [
            '1' => '티어 1',
            '2' => '티어 2',
            '3' => '티어 3',
        ],
        'quality' => [
            '10' => '10 이상',
            '20' => '20 이상',
            '30' => '30 이상',
            '40' => '40 이상',
            '50' => '50 이상',
            '60' => '60 이상',
            '70' => '70 이상',
            '80' => '80 이상',
            '90' => '90 이상',
        ],
        'etc' => [
            '1' => '기본 효과',
            '2' => '전투 특성',
            '3' => '각인 효과',
            '4' => '옵션 수량',
            '5' => '특수 효과',
        ],
        'etc_sub' => [
            '1' => [
                '3' => '힘',
                '4' => '민첩',
                '5' => '지능',
                '6' => '체력',
            ],
            '2' => [
                '15' => '치명',
                '16' => '특화',
                '17' => '제압',
                '18' => '신속',
                '19' => '인내',
                '20' => '숙련',
            ],
            '3' => [
                '255' => '각성',
                '286' => '갈증',
                '243' => '강령술',
                '129' => '강화 무기',
                '242' => '강화 방패',
                '288' => '결투의 대가',
                '225' => '고독한 기사',
                '125' => '광기',
                '188' => '광전사의 비기',
                '134' => '구슬동자',
                '123' => '굳은 의지',
                '190' => '극의: 체술',
                '142' => '급소 타격',
                '249' => '기습의 대가',
                '302' => '긴급구조',
                '199' => '넘치는 교감',
                '287' => '달의 소리',
                '238' => '달인의 저력',
                '254' => '돌격대장',
                '258' => '두 번째 동료',
                '168' => '마나 효율 증가',
                '251' => '마나의 흐름',
                '281' => '멈출 수 없는 충동',
                '253' => '바리케이드',
                '279' => '버스트',
                '246' => '번개의 분노',
                '245' => '부러진 뼈',
                '196' => '분노의 망치',
                '236' => '분쇄의 주먹',
                '235' => '불굴',
                '290' => '사냥의 시간',
                '198' => '상급 소환사',
                '244' => '선수필승',
                '256' => '세맥타통',
                '300' => '속전속결',
                '121' => '슈퍼 차지',
                '248' => '승부사',
                '298' => '시선 집중',
                '237' => '실드 관통',
                '282' => '심판자',
                '299' => '아드레날린',
                '284' => '아르데타인의 기술',
                '111' => '안정된 상태',
                '107' => '약자 무시',
                '110' => '에테르 포식자',
                '239' => '여신의 가호',
                '257' => '역천지체',
                '193' => '연속 포격',
                '141' => '예리한 둔기',
                '127' => '오의 강화',
                '292' => '오의난무',
                '280' => '완벽한 억제',
                '118' => '원한',
                '140' => '위기 모면',
                '291' => '일격필살',
                '278' => '잔재된 기운',
                '247' => '저주받은 인형',
                '301' => '전문의',
                '224' => '전투 태세',
                '195' => '절실한 구원',
                '276' => '절정',
                '277' => '절제',
                '293' => '점화',
                '109' => '정기 흡수',
                '303' => '정밀 단도',
                '259' => '죽음의 습격',
                '240' => '중갑 착용',
                '197' => '중력 수련',
                '194' => '진실된 용맹',
                '285' => '진화의 유산',
                '295' => '질량 증가',
                '189' => '초심',
                '167' => '최대 마나 증가',
                '296' => '추진력',
                '283' => '축복의 오라',
                '191' => '충격 단련',
                '297' => '타격의 대가',
                '202' => '탈출의 명수',
                '241' => '폭발물 전문가',
                '289' => '피스메이커',
                '192' => '핸드거너',
                '130' => '화력 강화',
                '294' => '환류',
                '201' => '황제의 칙령',
                '200' => '황후의 은총',
            ],
            '4' => [
                '1' => '고정 효과 수량',
                '2' => '부여 효과 수량',
            ],
            '5' => [
                '39' => '강타',
                '33' => '긴급 수혈',
                '38' => '돌진',
                '36' => '마나회수',
                '2' => '마법 방어력',
                '29' => '멸시',
                '30' => '무시',
                '1' => '물리 방어력',
                '28' => '반격',
                '31' => '반전',
                '26' => '속공',
                '35' => '앵콜',
                '37' => '오뚝이',
                '34' => '응급 처치',
                '6' => '전투 중 생명력 회복량',
                '4' => '최대 마나',
                '3' => '최대 생명력',
                '40' => '타격',
                '27' => '투자',
                '32' => '회생',
            ],
        ],
    ],
];
